app/Controllers/Product.php

    public function index()
    {
        $pager = \Config\Services::pager();
        $model = new Product_Model();
        $data['product']  = $model->getProduct()->getResult();
        $data['category']  = $model->getCategory()->getResult();
        $kunci = $this->request->getVar('cari');

        if ($kunci) {
            $query = $model->pencarian($kunci);
            $jumlah = "Pencarian dengan nama <B>$kunci</B> ditemukan ".$query->affectedRows()." Data";
        } else {
            $query = $model;
            $jumlah = "";
        }
        $data['product'] = $model->paginate(5);
---
SELECT *
FROM `product`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `product`