app/Models/Product_model.php

    public function getCategory()
    {
        $builder = $this->db->table('category');
        return $builder->get();
---
SELECT *
FROM `category`

    public function getProduct()
    {
        $builder = $this->db->table('product');
        $builder->select('*');
        $builder->join('category', 'category_id = product_category_id','left');
        return $builder->get();
---
SELECT *
FROM `product`
LEFT JOIN `category` ON `category_id` = `product_category_id`

    public function deleteProduct($id)
    {
        $query = $this->db->table('product')->delete(array('product_id' => $id));
---
DELETE FROM `product`
WHERE `product_id` = '11'